<template>
  <div>
    <NewHeader width-limited></NewHeader>
    <div class="main-container">
      <h2 style="margin-top: 30px; margin-left: 300px; margin-right: 300px">nioCoin产品的用户体验地图</h2>
      <h4 style="margin-top: 30px; margin-left: 300px; margin-right: 300px">小尼，17岁，高二学生</h4>
      <div class="content">
        <p class="para">&emsp;&emsp;随着互联网时代的到来，实体书经济受到了严重的冲击，人们越来越倾向于在网上购买电子书，甚至通过各种各样的途径下载盗版电子书享受阅读的乐趣。</p>
        <p class="para">&emsp;&emsp;电子书的风潮带来的是读书碎片化的问题，网文、短新闻、朋友圈等轻阅读的受众人群不断壮大，而在这一群人里，中学生乃至大学生可谓是主力人群。</p>
        <p class="para">&emsp;&emsp;小尼今年17岁，高二学生，正处在承担高三备考压力前夕。他在朋友的安利下入了网文的坑，每天都会在空闲的时候刷一刷网文来陶冶情操。但高中生的零花钱向来比较少，小尼更多的时候是用自己升入高中之前买的电脑来搜寻一些免费的网文资源。</p>
        <p class="para">&emsp;&emsp;在一次查找网文免费资源的时候，小尼邂逅了nioCoin这个平台。那天他像往常一样想找一本朋友推荐的经典网文《斗破苍穹》，在一个资源网站里，他发现这个网站贴出了一个非常直观的《斗破苍穹》人物知识图谱，他当时很好奇，一个提供免费文本资源的网站，是怎样做到呈现这样一张效果惊艳的知识图谱的，他看到那张图谱的水印上写着nio.icimence.cn，抱着探索的心态，他在浏览器输入了这个地址，于是，一段奇妙的知识图谱探索旅程就此在小尼面前展开。</p>
        <p class="para">&emsp;&emsp;小尼从平台首页了解到，这是一个专门针对小说人物关系进行知识图谱构建的平台，此时的小尼其实并不了解知识图谱到底是什么东西，但根据那个免费网文资源网站呈现的人物关系截图，他大概猜测到这个平台可以做到把小说文本上传上去，平台可以自动生成这样的关系图谱。</p>
        <p class="para">&emsp;&emsp;小尼从首页的Start点进去，系统提示登录nioCoin，小尼注册了一个账户，进入之后显示了一个可以新建项目的界面。</p>
        <p class="para">&emsp;&emsp;正当小尼不知道下一步如何操作的时候，他看到导航栏上写着User Guide，他迅速浏览了一遍，平台看上去很高大上，但其实操作很友好。</p>
        <p class="para">&emsp;&emsp;他点击新建空项目，将下载好的《斗破苍穹》文本上传到了平台上，自定义图谱的名称为“斗破苍穹”，跟随着系统的指引，他在得到第一轮预热抽取结果后，因为不熟悉这本书，所以跳过了实体增删改和关系删除的步骤，等待了一段时间后，他得到了一张《斗破苍穹》的完整的人物关系图谱。</p>
        <p class="para">&emsp;&emsp;奇怪的是，他得到的图谱跟资源网站上提供的略有出入，这时他想起平台支持在线编辑知识图谱，于是他尝试按照资源网站上的最终人物关系图在线修改了得到的知识图谱，操作简单便捷，人物关系图更加清晰。</p>
        <p class="para">&emsp;&emsp;在熟悉这一系列基本操作之后，他开始探索平台更多的功能，比如可以新建一个空项目，然后把这个平台完全当成一个知识图谱画图构建工具，而且平台支持多种节点样式和关系边样式，他在一次语文课的演讲中就用nioCoin绘制了小说中的人物关系图放到了ppt中，立刻提升了自己的演讲逼格。</p>
        <p class="para">&emsp;&emsp;平时，他会在安利小说的时候提前将小说文本输入到nioCoin平台中生成一个知识图谱，因为熟悉小说内容，所以在第一轮预热抽取中他修改并删除和添加了一些人物名称，使得二轮预测出的人物关系网更加精确，大大减轻了在线编辑的时间。他将生成好的知识图谱导出成图保存在本地，这样在和同学安利小说的时候，也可以通过看图片的方式更清晰地呈现小说中的主要故事脉络。</p>
        <p class="para">&emsp;&emsp;平台每隔一段时间就会更新自己的界面以及修改bug、新增功能，这些年以来，小尼一直将nioCoin收藏在自己的浏览器书签里，当做一个在线编辑知识图谱的工具以及辅助知识抽取的工具。nioCoin也随着功能的完善受到越来越多用户的欢迎。</p>
      </div>
    </div>
  </div>
</template>

<script>
import {NewHeader} from "../../components/NewHeader";

export default {
  components: {NewHeader}
};
</script>

<style scoped src="./style.less" />